/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ CBS                                         */
/*        SUB-SYSTEM        ････ GFP通信制御                                 */
/*        PROGRAM-ID        ････ GFPCSX00                                    */
/*        FUNCTION          ････ NW個別モジュール                            */
/*                               ヘッダーレイアウトチェック処理(ダミー)      */
/*                                 本プロシージャでは処理は実施せず、        */
/*                                 戻り値は0(正常）のみを返す。              */
/*        AUTHER            ････ HAS T.Fukunaga                              */
/*        PROGRAM-CALL      ････                                             */
/*        WRITTEN-DATE      ････ 2024-10-01                                  */
/*        UPDATE            ････                                             */
/*                                                                           */
/*   版  修正者     修正日     修正内容                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  T.Fukunaga 2024/10/01 (J0680)新規作成                               */
/*  1.1  S.Kimura   2025/01/31 (J0680)パラメータ追加                         */
/*                                                                           */
/*****************************************************************************/
/****************************************************************************/
/*   ｺﾝﾊﾟｲﾙｵﾌﾟｼｮﾝ                                                           */
/****************************************************************************/
#pragma ENV COMMON

/****************************************************************************/
/*   INCLUDE定義                                                            */
/****************************************************************************/
/* STANDARD HEADER */
#include <stdbool.h>  nolist
#include <stdio.h>    nolist
#include <stdlib.h>   nolist
#include <string.h>   nolist
#include <cextdecs.h> nolist
#include <tal.h>

/* USER HEADER     */
#include "NWM_MTI.h"
#include "vproc.h"

/****************************************************************************/
/*   DEFINE定義                                                             */
/****************************************************************************/
/****************************************************************************/
/*   内部関数宣言                                                           */
/****************************************************************************/

/****************************************************************************/
/*  FUNCTION        : 1.0.0  NWM_MTI                                        */
/*  CALLING SEQ.    : short NWM_MTI(char *, short, short, short *)          */
/*  ARGUMENT        : 1.recv_msg       (I)   受信電文                       */
/*                  : 2.recv_len       (I)   受信電文長                     */
/*                  : 3.i_data_offset  (I)   電文データ開始位置(入力)       */
/*                  : 4.o_data_offset  (O)   電文データ開始位置(判定結果)   */
/*                  : 5.hb_resp_send   (O)   送信電文(ハートビート応答)     */
/*                  : 6.s_hb_resp_leng (O)   送信電文長(ハートビート応答)   */
/*  RETURN CODE     :  1 :一般電文                                          */
/*                  :  2 :リジェクトメッセージ                              */
/*                  :  3 :ハートビートメッセージ                            */
/*                  :  4 :アイドルメッセージ正常                            */
/*                  : -1 :電文長不正                                        */
/*  DESCRIPTION     : ヘッダーレイアウトのチェックを行う                    */
/****************************************************************************/
short NWM_MTI(char   *recv_msg 
             ,short   recv_len 
             ,short   i_data_offset
             ,short  *o_data_offset
             ,char   *hb_resp_send
             ,short  *s_hb_resp_leng)
{
    *o_data_offset = i_data_offset;
    return(DEF_NWM_MTI_RTN_GENERAL);
}
/* end of NWM_MTI */
