/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            •••• CBS                                         */
/*        SUB-SYSTEM        •••• GFPí êMêßå‰                                 */
/*        PROGRAM-ID        •••• GFPCSX60                                    */
/*        FUNCTION          •••• ìdï∂ÉwÉbÉ_ìdï∂í∑ï“èW[ã§í ]                  */
/*        AUTHER            •••• HAS S.Kimura                                */
/*        WRITTEN-DATE      •••• 2025-05-23                                  */
/*                                                                           */
/*        UPDATE            ••••                                             */
/*                                                                           */
/*   î≈  èCê≥é“     èCê≥ì˙     èCê≥ì‡óe                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  S.Kimura   2025/05/23 (J0680)êVãKçÏê¨                               */
/*                                                                           */
/*****************************************************************************/
#ifndef VPROC_H
#define VPROC_H

#define VPROC T0000A00_12JUL25_GFPCSX00_1000

void VPROC(void)  {return;}

#endif
