/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ GFP                                         */
/*        SUB-SYSTEM        ････ 通信制御                                    */
/*        PROGRAM-ID        ････ GFPCVXD0                                    */
/*        FUNCTION          ････ マンドサーバ                                */
/*        AUTHER            ････ ISYS Y.Kawasaki                             */
/*        WRITTEN-DATE      ････ 2025-02-28                                  */
/*                                                                           */
/*        UPDATE            ････                                             */
/*                                                                           */
/*   版  修正者     修正日     修正内容                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  Y.Kawasaki 2026/01/14 (J0680)新規作成                               */
/*  1.1  M.Matumoto 2026/05/20 (J0680)DR運用対応                             */
/*                                                                           */
/*****************************************************************************/
#ifndef VPROC_H
#define VPROC_H

#define VPROC T0000A00_20MAY26_GFPCVXD0_1000

void VPROC(void)  {return;}

#endif
