/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ CBS                                         */
/*        SUB-SYSTEM        ････ GFP通信制御                                 */
/*        PROGRAM-ID        ････ GFPCSN90                                    */
/*        FUNCTION          ････ NW個別(カットオーバー個別処理[NYCE])        */
/*        AUTHER            ････ HAS                                         */
/*        PROGRAM-CALL      ････                                             */
/*        WRITTEN-DATE      ････ 2025-03-31                                  */
/*                                                                           */
/*        UPDATE            ････                                             */
/*                                                                           */
/*   版  修正者     修正日     修正内容                                      */
/*  ==== ========== ========== ============================================= */
/*                                                                           */
/*****************************************************************************/
#ifndef VPROC_H
#define VPROC_H

#define VPROC T0000A00_27NOV25_GFPCSN90_1000

void VPROC(void)  {return;}

#endif
