/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            •••• GFP                                         */
/*        SUB-SYSTEM        •••• í êMêßå‰                                    */
/*        PROGRAM-ID        •••• GFPCS930                                    */
/*        FUNCTION          •••• ìdï∂ÉwÉbÉ_ï“èW[J-linklk]                    */
/*        AUTHER            •••• ISYS N.Miki                                 */
/*        WRITTEN-DATE      •••• 2025-03-10                                  */
/*                                                                           */
/*        UPDATE            ••••                                             */
/*                                                                           */
/*   î≈  èCê≥é“     èCê≥ì˙     èCê≥ì‡óe                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  N.Miki     2025/03/10  êVãKçÏê¨                                     */
/*  1.1  K.Mishima  2025/04/17  åãçáïsãÔçáëŒâû                               */
/*                                                                           */
/*****************************************************************************/
#ifndef VPROC_H
#define VPROC_H

#define VPROC T0000A00_17APR25_GFPCS930_1000

void VPROC(void)  {return;}

#endif
