/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ CBS                                         */
/*        SUB-SYSTEM        ････ GFP通信制御                                 */
/*        PROGRAM-ID        ････ GFPCSx60                                    */
/*        FUNCTION          ････ NW個別(電文ヘッダ電文長編集)                */
/*        AUTHER            ････ HAS M.Matsumoto                             */
/*        PROGRAM-CALL      ････                                             */
/*        WRITTEN-DATE      ････ 2025-04-01                                  */
/*        UPDATE            ････                                             */
/*                                                                           */
/*   版  修正者     修正日     修正内容                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  Matsumoto  2025/04/01 (J0680)新規作成                               */
/*                                                                           */
/*****************************************************************************/

#ifndef _NWM_HDL_H
#define _NWM_HDL_H

/* 処理結果 */
#define DEF_HDL_NORMAL              0       /* 正常                         */
#define DEF_HDL_ERROR               9       /* エラー                       */

/* プロトタイプ宣言 */
short NWM_HDL(char*, short);

#endif /* _GFPCSJ40_H */
