/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ CBS                                         */
/*        SUB-SYSTEM        ････ GFP通信制御                                 */
/*        PROGRAM-ID        ････ GFPCSx50                                    */
/*        FUNCTION          ････ NW個別(要求応答マッチングキー生成)          */
/*        AUTHER            ････ HAS M.Matsumoto                             */
/*        PROGRAM-CALL      ････                                             */
/*        WRITTEN-DATE      ････ 2025-04-01                                  */
/*        UPDATE            ････                                             */
/*                                                                           */
/*   版  修正者     修正日     修正内容                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  Matsumoto  2025/04/01 (J0680)新規作成                               */
/*                                                                           */
/*****************************************************************************/
#ifndef _NWM_MKM_H
#define _NWM_MKM_H

/* 処理結果 */
#define DEF_MKM_NORMAL              0       /* 正常                         */
#define DEF_MKM_ERROR               1       /* エラー                       */

/* プロトタイプ宣言 */
short NWM_MKM(char*, queue_data_def*, char*, char*, short, short*);

#endif

