/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ CBS                                         */
/*        SUB-SYSTEM        ････ GFP通信制御                                 */
/*        PROGRAM-ID        ････ GFPCSx40                                    */
/*        FUNCTION          ････ NW個別(電文種別判定)                        */
/*        AUTHER            ････ HAS M.Matsumoto                             */
/*        PROGRAM-CALL      ････                                             */
/*        WRITTEN-DATE      ････ 2025-04-01                                  */
/*        UPDATE            ････                                             */
/*                                                                           */
/*   版  修正者     修正日     修正内容                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  Matsumoto  2025/04/01 (J0680)新規作成                               */
/*                                                                           */
/*****************************************************************************/

#ifndef _NWM_MSJ_H
#define _NWM_MSJ_H

/* 処理結果 */
#define DEF_MSJ_NORMAL              0       /* 正常                         */
#define DEF_MSJ_ERROR               1       /* エラー                       */

/* プロトタイプ宣言 */
short NWM_MSJ(char*, char*, char*);

#endif /* _NWM_MSJ_H */
