/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ CBS                                         */
/*        SUB-SYSTEM        ････ GFP通信制御                                 */
/*        PROGRAM-ID        ････ GFPCSX60                                    */
/*        FUNCTION          ････ NW個別(電文ヘッダ電文長編集[共通])          */
/*                                                                           */
/*        AUTHER            ････ HAS S.Kimura                                */
/*        PROGRAM-CALL      ････                                             */
/*                                                                           */
/*        WRITTEN-DATE      ････ 2025-05-23                                  */
/*        UPDATE            ････                                             */
/*                                                                           */
/*   版  修正者     修正日     修正内容                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  S.Kimura   2025/05/23 (J0680)新規作成                               */
/*                                                                           */
/*****************************************************************************/
/****************************************************************************/
/*   ｺﾝﾊﾟｲﾙｵﾌﾟｼｮﾝ                                                           */
/****************************************************************************/
#pragma ENV COMMON

/****************************************************************************/
/*   INCLUDE定義                                                            */
/****************************************************************************/
/* STANDARD HEADER */
#include <string.h> nolist
#include <stdio.h> nolist

/* USER HEADER     */
#include "vproc.h"
#include "GFPCSX60.h"

/****************************************************************************/
/*  FUNCTION        : 1.1.0  電文ヘッダ電文長編集処理                       */
/*  CALLING SEQ.    : short NWM_HDL(char*, short)                           */
/*  ARGUMENT        : 1.textbuf        (I/O) 電文バッファ                   */
/*                  : 2.textlen        (I)   ISO8583電文長                  */
/*  RETURN CODE     : 0:正常 1:エラー                                       */
/*  DESCRIPTION     : NW個別(電文ヘッダ電文長編集[共通])                    */
/****************************************************************************/
short NWM_HDL(char *textbuf, short textlen)
{
    return DEF_HDL_NORMAL;
} /* end of NWM_HDL */

