/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ CBS                                         */
/*        SUB-SYSTEM        ････ GFP通信制御                                 */
/*        PROGRAM-ID        ････ GFPCSVC0                                    */
/*        FUNCTION          ････ NW個別(通知電文個別）                       */
/*                                                                           */
/*        AUTHER            ････ HAS K.F                                     */
/*        PROGRAM-CALL      ････                                             */
/*                                                                           */
/*        WRITTEN-DATE      ････ 2025-04-18                                  */
/*        UPDATE            ････                                             */
/*                                                                           */
/*   版  修正者     修正日     修正内容                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  K.F        2025/04/18 新規作成                                      */
/*                                                                           */
/*****************************************************************************/
/*****************************************************************************/
/*   DEFINE定義                                                             */
/*****************************************************************************/
#define DEF_NOTANSER        1                            // 応答電文なし
#define DEF_ANSER           2                            // 応答電文あり
#define DEF_EDITERROR       9                            // 編集エラー
#define DEF_NOTICE          1                            // 通知電文
#define DEF_REQTELEGRAM     2                            // 要求応答型要求電文
#define DEF_ANSTELEGRAM     3                            // 要求応答型応答電文
#define DEF_AUDITERROR      9                            // 精査異常

