/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            •••• CBS                                         */
/*        SUB-SYSTEM        •••• GFPí êMêßå‰                                 */
/*        PROGRAM-ID        •••• GFPCSVC0                                    */
/*        FUNCTION          •••• NWå¬ï (í ímìdï∂å¬ï Åj                       */
/*        AUTHER            •••• HAS K.F                                     */
/*        PROGRAM-CALL      ••••                                             */
/*        WRITTEN-DATE      •••• 2025-04-18                                  */
/*                                                                           */
/*        UPDATE            ••••                                             */
/*                                                                           */
/*   î≈  èCê≥é“     èCê≥ì˙     èCê≥ì‡óe                                      */
/*  ==== ========== ========== ============================================= */
/*                                                                           */
/*****************************************************************************/
#ifndef VPROC_H
#define VPROC_H

#define VPROC T0000A00_12JUL25_GFPCSVC0_1000

void VPROC(void)  {return;}

#endif
