/******************************************************************************
*                                                                             *
*                               ＜GFP通信制御＞                               *
*                                                                             *
*                               ＜コネクション制御(クライアント)＞            *
*                                                                             *
*        VERSION                               :＜1.0.0＞                     *
*                                                                             *
*        CREATE DATE                           :＜作成日 2025/03/01＞         *
*        CODED                                 :＜ISYS＞                      *
*                                                                             *
*        MODIFY DATE                           :＜修正日 yyyy／mm／dd＞       *
*        CODED                                 :＜修正者＞                    *
*                                              :＜修正概要＞                  *
******************************************************************************/
/*****************************************************************************/
/*****                    <<     head PROGRAM      >>                    *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ CBS                                         */
/*        SUB-SYSTEM        ････ GFP制御                                     */
/*        PROGRAM-ID        ････ GFPCVX20                                    */
/*        FUNCTION          ････ コネクション制御(クライアント)              */
/*                                                                           */
/*        AUTHOR            ････ ISYS Kudo                                   */
/*        PROGRAM-CALL      ････                                             */
/*                                                                           */
/*        WRITTEN-DATE      ････ 2025/03/01                                  */
/*                                                                           */
/*        UPDATE            ････                                             */
/*                                                                           */
/*  版   修正者      修正日     修正内容                                     */
/*  ==== ========== ========== ============================================= */
/*  1.0  ISYS 工藤   2025/03/01 新規作成                                     */
/****************************************************************************/
#include <limit.h>

/****************************************************************************/
/*   DEFINE定義                                                             */
/****************************************************************************/
#ifndef __sel_conf_ind_t__
#define __sel_conf_ind_t__
typedef enum __sel_conf_ind_t
{
    null_conf,
    primary_conf,
    secondary_conf,
    max_conf
} sel_conf_ind_t;
#endif

#ifndef __max_threads__
#define __max_threads__
#define DEF_MAX_GFNWI CCC_MAX_connection  // 最大NW情報レコード数
#define DEF_MAX_GFLIN CCC_MAX_connection  // 最大回線管理レコード数=接続数 TODO:最大スレッド数としてパラメータ化が必要
#define DEF_MAX_OUTP  100                 // 接続状態通知先の最大プロセス数
#define DEF_MAX_IN_SC 16                  // inbound サーバクラス数リンク数
#endif
