#pragma once
/******************************************************************************
*                                                                             *
*                               ＜GFP通信制御＞                               *
*                                                                             *
*                               ＜コネクション制御(クライアント)＞            *
*                                                                             *
*        VERSION                               :＜1.0.0＞                     *
*                                                                             *
*        CREATE DATE                           :＜作成日 2025/02/05＞         *
*        CODED                                 :＜ISYS＞                      *
*                                                                             *
*        MODIFY DATE                           :＜修正日 yyyy／mm／dd＞       *
*        CODED                                 :＜修正者＞                    *
*                                              :＜修正概要＞                  *
******************************************************************************/
/*****************************************************************************/
/*****                    <<     head PROGRAM      >>                    *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ CBS                                         */
/*        SUB-SYSTEM        ････ GFP制御                                     */
/*        PROGRAM-ID        ････ GFPCVX20                                    */
/*        FUNCTION          ････ コネクション制御(クライアント)              */
/*                                                                           */
/*        AUTHOR            ････ ISYS Kudo                                   */
/*        PROGRAM-CALL      ････                                             */
/*                                                                           */
/*        WRITTEN-DATE      ････ 2025/02/05                                  */
/*                                                                           */
/*        UPDATE            ････                                             */
/*                                                                           */
/*  版   修正者      修正日     修正内容                                     */
/*  ==== ========== ========== ============================================= */
/*  1.0  ISYS 工藤   2025/03/01 新規作成                                     */
/****************************************************************************/
/****************************************************************************/
/*   INCLUDE定義                                                            */
/****************************************************************************/
/* STANDARD HEADER */
#include "GFPCVX20_thread_header.h" nolist
/* USER HEADER     */
#include <GFPCGXC0.h> nolist

/****************************************************************************/
/*   DEFINE定義                                                             */
/****************************************************************************/

//サーバから引用
/*■DEF_RECVDEPTH(現在値1142、定義上の最大16300)*/
/*コネクションrecv+send+recv_timer+send_timer*/
/*リスナーWR+timer*/
/*Inbound電分振分同時PATHSEND数*/
/*Outbound電分振分数*/
/*$RECEIVEのREADUPDATE、コマンドサーバー*/
#define DEF_RECVDEPTH ((DEF_MAX_GFLIN * 4) + \
                       DEF_MAX_IN_SC + \
                       (DEF_MAX_OUTP * 2) + \
                       1 + 1)

#define DEF_CMDS_QUALIFIER              ".#GFPCI" // コマンドサーバクオリファイア
#define DEF_LABEL_COMMAND 2000                          /*コマンドインターフェース用OPENラベル*/
#define DEF_LABEL_CREATOR 2001                          /*クリエータ用OPENラベル*/
#define DEF_LABEL_LINKMON 2002                          /*LINKMONOOPENラベル*/

/****************************************************************************/
/*   外部データ定義                                                         */
/****************************************************************************/
#pragma fieldalign shared2 __cmp_ipc_interface_t
typedef struct __cmp_ipc_interface_t
{
    COM_STP_arg_1_def *i_openers;
    short receive_fno;
}cmp_ipc_interface_t;

/****************************************************************************/
/*   関数定義                                                             */
/****************************************************************************/
thread_object_t * cncl_create_ipc();
short cncl_ipc_start(thread_object_t * thread_income);
short cncl_ipc_received(Event_tag_t *event);
