#pragma once
/******************************************************************************
*                                                                             *
*                               ＜GFP通信制御＞                               *
*                                                                             *
*                               ＜コネクション制御(クライアント)＞            *
*                                                                             *
*        VERSION                               :＜1.0.0＞                     *
*                                                                             *
*        CREATE DATE                           :＜作成日 2025/11/13＞         *
*        CODED                                 :＜ISYS＞                      *
*                                                                             *
*        MODIFY DATE                           :＜修正日 yyyy／mm／dd＞       *
*        CODED                                 :＜修正者＞                    *
*                                              :＜修正概要＞                  *
******************************************************************************/
/*****************************************************************************/
/*****                    <<     head PROGRAM      >>                    *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ CBS                                         */
/*        SUB-SYSTEM        ････ GFP制御                                     */
/*        PROGRAM-ID        ････ GFPCVX20                                    */
/*        FUNCTION          ････ コネクション制御(クライアント)              */
/*                                                                           */
/*        AUTHOR            ････ ISYS Kudo                                   */
/*        PROGRAM-CALL      ････                                             */
/*                                                                           */
/*        WRITTEN-DATE      ････ 2025/11/13                                  */
/*                                                                           */
/*        UPDATE            ････                                             */
/*                                                                           */
/*  版   修正者      修正日     修正内容                                     */
/*  ==== ========== ========== ============================================= */
/*  1.0  ISYS 工藤  2025/11/13 新規作成                                      */
/****************************************************************************/



/****************************************************************************/
/*   INCLUDE定義                                                            */
/****************************************************************************/
/* STANDARD HEADER */
/* USER HEADER     */

//--> ここから
#ifdef _TANDEM_SOURCE
#ifndef __db_glnlg__
#define __db_glnlg__
#include <file.h(db_glnlg)> nolist
#endif
#else
#ifndef __file_h__
#define __file_h__
#include <file.h> nolist
#endif
#endif
#include <ipc.h> nolist
