/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            •••• CBS                                         */
/*        SUB-SYSTEM        •••• GFPí êMêßå‰                                 */
/*        PROGRAM-ID        •••• GFPCVXH0                                    */
/*        FUNCTION          •••• åÆä«óùÉtÉ@ÉCÉãIO                            */
/*                                                                           */
/*        AUTHER            •••• HAS T.Hashimoto                             */
/*        PROGRAM-CALL      ••••                                             */
/*                                                                           */
/*        WRITTEN-DATE      •••• 2026-04-21                                  */
/*                                                                           */
/*        UPDATE            ••••                                             */
/*                                                                           */
/*  î≈   èCê≥é“      èCê≥ì˙     èCê≥ì‡óe                                     */
/*  ==== =========== ========== ============================================ */
/*  1.0  T.Hashimoto 2026/04/21 (xxxxx)êVãKçÏê¨                              */
/*****************************************************************************/
#ifndef VPROC_H
#define VPROC_H

#define VPROC T0000A00_24APL26_GFPCVXH0_1000

void VPROC(void)  {return;}

#endif
