/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ GFP                                         */
/*        SUB-SYSTEM        ････ 通信制御                                    */
/*        PROGRAM-ID        ････ GFPCSD50                                    */
/*        FUNCTION          ････ NW個別モジュール                            */
/*                               要求応答マッチングキー生成(Discover)        */
/*                                                                           */
/*                                                                           */
/*        AUTHER            ････ ISYS N.Miki                                 */
/*        PROGRAM-CALL      ････                                             */
/*        WRITTEN-DATE      ････ 2025-04-30                                  */
/*        UPDATE            ････                                             */
/*                                                                           */
/*   版  修正者     修正日     修正内容                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  N.Miki     2025/04/30 (J0680)新規作成                               */
/*                                                                           */
/*****************************************************************************/
/****************************************************************************/
/*   DEFINE定義                                                             */
/****************************************************************************/

/*===========================================================================*/
/*   リターンコード                                                          */
/*===========================================================================*/
#define DEF_RETURN_NORMAL       0
#define DEF_RETURN_ERROR        1

/****************************************************************************/
/* 構造体のtypedef定義                                                      */
/****************************************************************************/
typedef struct __key_info_discover
{
    char    MTI[DEF_MTI_SIZE];                              // MTI
    char    tsm_date_and_time[DEF_BIT7_SET_SIZE];            // 取引日時(BIT7)
    char    audit_number[DEF_BIT11_SET_SIZE];                // システムトレースオーディットナンバー(BIT11)
    char    A_I_identification_code[DEF_BIT32_SET_SIZE];     // Acquiring Institution Identification Code(BIT32)
    char    R_I_identification_code[DEF_BIT100_SET_SIZE];    // Receiving Institution Identification Code(BIT100)
} key_info_discover_def;
