/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ CBS                                         */
/*        SUB-SYSTEM        ････ GFP通信制御                                 */
/*        PROGRAM-ID        ････ GFPCSV30                                    */
/*        FUNCTION          ････ NW個別モジュール                            */
/*                               電文ヘッダ編集(VisaNet)                     */
/*                                 指定された編集前電文に必要な場合          */
/*                                 VMLHを付与して編集後電文に設定を行う。    */
/*        AUTHER            ････ HAS S.Kimura                                */
/*        PROGRAM-CALL      ････                                             */
/*        WRITTEN-DATE      ････ 2025-01-24                                  */
/*                                                                           */
/*        UPDATE            ････                                             */
/*                                                                           */
/*   版  修正者     修正日     修正内容                                      */
/*  ==== ========== ========== ============================================= */
/*                                                                           */
/*****************************************************************************/
#ifndef VPROC_H
#define VPROC_H

#define VPROC T0000A00_12JUL25_GFPCSV30_1000

void VPROC(void)  {return;}

#endif
