/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ GFP                                         */
/*        SUB-SYSTEM        ････ 通信制御                                    */
/*        PROGRAM-ID        ････ GFPCRXE0                                    */
/*        FUNCTION          ････ コマンドIF                                  */
/*        AUTHER            ････ ISYS K.Mishima                              */
/*        WRITTEN-DATE      ････ 2025-02-21                                  */
/*                                                                           */
/*        UPDATE            ････ 2025-04-11                                  */
/*                                                                           */
/*   版  修正者     修正日     修正内容                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  K.Mishima 2025/02/21  (J0680)新規作成                               */
/*  1.1  K.Mishima 2025/04/11  (J0680)バッファクリア方法変更                 */
/*  1.2  K.Mishima 2025/04/30  (J0680)一部コマンド名称変更                   */
/*  1.3  K.Mishima 2025/06/25  (J0680)照会コマンド修正                       */
/*  1.4  K.Mishima 2025/12/18  (J0680)fgetsエラーハンドリングを追加          */
/*****************************************************************************/
#ifndef VPROC_H
#define VPROC_H

#define VPROC T0000A00_12DEC25_GFPCRXE0_1000

void VPROC(void)  {return;}

#endif
