#/******************************************************************************
*                                                                             *
*                               ÅÉGFPí êMêßå‰ÅÑ                               *
*                                                                             *
*                               ÅÉsrc\GFPCGX24.cÅÑ                            *
*                                                                             *
*        VERSION                               :ÅÉ1.0.0ÅÑ                     *
*                                                                             *
*        CREATE DATE                           :ÅÉçÏê¨ì˙ 2025/11/11ÅÑ         *
*        CODED                                 :ÅÉISYSÅÑ                      *
*                                                                             *
*        MODIFY DATE                           :ÅÉèCê≥ì˙ yyyyÅ^mmÅ^ddÅÑ       *
*        CODED                                 :ÅÉèCê≥é“ÅÑ                    *
*                                              :ÅÉèCê≥äTóvÅÑ                  *
******************************************************************************/
/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            •••• CBS                                         */
/*        SUB-SYSTEM        •••• GFPêßå‰                                     */
/*        PROGRAM-ID        •••• GFPCGX24.c                                  */
/*        FUNCTION          •••• GFPCGX24.c                                  */
/*                                                                           */
/*        AUTHER            •••• ISYS Kudo                                   */
/*        PROGRAM-CALL      ••••                                             */
/*                                                                           */
/*        WRITTEN-DATE      •••• 2025/11/11                                  */
/*                                                                           */
/*        UPDATE            ••••                                             */
/*                                                                           */
/*  î≈   èCê≥é“      èCê≥ì˙     èCê≥ì‡óe                                     */
/*  ==== ========== ========== ============================================= */
/*  1.0  ISYS çHì°  2025/11/11 êVãKçÏê¨                                      */
/****************************************************************************/

#include <GFPCGX20.h>
#/****************************************************************************/
/*  FUNCTION        : __ffd_def_opaqueí∑éÊìæèàóù                            */
/*  CALLING SEQ.    : sizeof_ffd_opaque()                                   */
/*  ARGUMENT        : Ç»Çµ                                                  */
/*                  :                                                       */
/*  DESCRIPTION     : __ffd_def_opaqueÇÃÉTÉCÉYÇï‘Ç∑ÅB                      */
/****************************************************************************/
size_t sizeof_ffd_opaque()
{
    return sizeof(ffd_def);
}
#/****************************************************************************/
/*  FUNCTION        : __ffd_index_def_opaqueí∑éÊìæèàóù                      */
/*  CALLING SEQ.    : sizeof_ffd_index_opaque()                             */
/*  ARGUMENT        : Ç»Çµ                                                  */
/*                  :                                                       */
/*  RETURN CODE     : __ffd_index_def_opaqueÇÃÉTÉCÉY                        */
/*  DESCRIPTION     : __ffd_index_def_opaqueÇÃÉTÉCÉYÇï‘Ç∑ÅB                */
/****************************************************************************/
size_t sizeof_ffd_index_opaque()
{
    return sizeof(ffd_index_def);
}
