/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            ････ CBS                                         */
/*        SUB-SYSTEM        ････ GFP通信制御                                 */
/*        PROGRAM-ID        ････ GFPCSV50                                    */
/*        FUNCTION          ････ NW個別(要求応答マッチングキー生成[VISANET]) */
/*                                                                           */
/*        AUTHER            ････ HAS K.F                                     */
/*        PROGRAM-CALL      ････                                             */
/*                                                                           */
/*        WRITTEN-DATE      ････ 2025-04-18                                  */
/*        UPDATE            ････                                             */
/*                                                                           */
/*   版  修正者     修正日     修正内容                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  K.F        2025/04/18 新規作成                                      */
/*                                                                           */
/*****************************************************************************/

#ifndef _GFPCSV50_H
#define _GFPCSV50_H

/****************************************************************************/
/*   INCLUDE定義                                                            */
/****************************************************************************/
#include "msg_VI.h"

/****************************************************************************/
/*   DEFINE定義                                                             */
/****************************************************************************/
#define DEF_MKM_MATCHKEY_SIZE       50      /* マッチングキー最大長         */

/* 処理区分 */
#define DEF_MKM_REQ                 1       /* 要求用                       */
#define DEF_MKM_RES                 2       /* 応答用                       */

/* 処理結果 */
#define DEF_MKM_NORMAL              0       /* 正常                         */
#define DEF_MKM_ERROR               1       /* エラー                       */

/* マッチングキー最大バイト長 */
#define DEF_MAX_MATCHINGKEY         26

/****************************************************************************/
/*   TYPEDEF定義                                                            */
/****************************************************************************/
/* マッチングキー情報 */
#pragma fieldalign shared2 __mkm_matchkey_def
typedef struct __mkm_matchkey_def
{
    char    ctrl_src_id[6];         /* GFP側 STATION ID                     */
    char    mti[4];                 /* MTI                                  */
    char    local_tran_time[12];    /* 現地取引日時                         */
    char    function_code[4];       /* ファンクションコード                 */
} mkm_matchkey_def;

#endif /* _GFPCSV50_H */
