/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            •••• GFP                                         */
/*        SUB-SYSTEM        •••• í êMêßå‰                                    */
/*        PROGRAM-ID        •••• GFPCGXG0                                    */
/*        FUNCTION          •••• ÉvÉçÉZÉXèÓïÒéÊìæ                            */
/*        AUTHER            •••• ISYS Y.Kawasaki                             */
/*        WRITTEN-DATE      •••• 2025-01-08                                  */
/*                                                                           */
/*        UPDATE            ••••                                             */
/*                                                                           */
/*   î≈  èCê≥é“     èCê≥ì˙     èCê≥ì‡óe                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  Y.Kawasaki 2025/01/08 (J0680)êVãKçÏê¨                               */
/*                                                                           */
/*****************************************************************************/
#ifndef VPROC_H
#define VPROC_H

#define VPROC T0000A00_08JAN25_GFPCGXG0_1000

void VPROC(void)  {return;}

#endif
