/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            •••• GFP                                         */
/*        SUB-SYSTEM        •••• í êMêßå‰                                    */
/*        PROGRAM-ID        •••• GFPCVXF0                                    */
/*        FUNCTION          •••• ÉçÉOèoóÕ                                    */
/*        AUTHER            •••• ISYS K.Tanigawa                             */
/*        WRITTEN-DATE      •••• 2025-04-15                                  */
/*                                                                           */
/*        UPDATE            ••••                                             */
/*                                                                           */
/*   î≈  èCê≥é“     èCê≥ì˙     èCê≥ì‡óe                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  K.Tanigawa 2025/04/15 (J0680)êVãKçÏê¨                               */
/*                                                                           */
/*****************************************************************************/
#ifndef VPROC_H
#define VPROC_H

#define VPROC T0000A00_23APR25_GFPCVXF0_1000

void VPROC(void)  {return;}

#endif
