#ifndef _GFPCSJC0_H_
#define _GFPCSJC0_H_
/**
 * @brief GFPCSJC0.h 通知電文個別処理(CARDNET)ヘッダーファイル
 *
 * @date 2025/04/14 新規作成 by HAS
 *
*/
/*   ｺﾝﾊﾟｲﾙｵﾌﾟｼｮﾝ                                                           */
/****************************************************************************/

/****************************************************************************/
/*   INCLUDE定義                                                            */
/****************************************************************************/
/* STANDARD HEADER */
#include <netdb.h>    nolist
#include <stdarg.h>   nolist
#include <stdlib.h>   nolist
#include <string.h>   nolist
#include <tal.h>      nolist
#include <cextdecs.h> nolist

/* USER HEADER     */
#include "GFPCVXC0.h"
#include "vproc.h"

/****************************************************************************/
/*   DEFINE定義                                                             */
/****************************************************************************/

/* 関数のプロトタイプ宣言 */

/* -------------------------------------------------------*/
/* 定数定義                                               */
/* -------------------------------------------------------*/

/* -------------------------------------------------------*/
/* 構造体のtypedef定義                                    */
/* -------------------------------------------------------*/

#endif /* _GFPCSJC0_H_ */
