/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            •••• CBS                                         */
/*        SUB-SYSTEM        •••• GFPí êMêßå‰                                 */
/*        PROGRAM-ID        •••• GFPCSA30                                    */
/*        FUNCTION          •••• NWå¬ï (ìdï∂ÉwÉbÉ_ï“èW[AEGN])                */
/*        AUTHER            •••• HAS                                         */
/*        PROGRAM-CALL      ••••                                             */
/*        WRITTEN-DATE      •••• 2025-07-12                                  */
/*                                                                           */
/*        UPDATE            ••••                                             */
/*                                                                           */
/*   î≈  èCê≥é“     èCê≥ì˙     èCê≥ì‡óe                                      */
/*  ==== ========== ========== ============================================= */
/*                                                                           */
/*****************************************************************************/
#ifndef VPROC_H
#define VPROC_H

#define VPROC T0000A00_24JUL25_GFPCSA30_1000

void VPROC(void)  {return;}

#endif
