/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            •••• CBS                                         */
/*        SUB-SYSTEM        •••• GFPí êMêßå‰                                 */
/*        PROGRAM-ID        •••• GFPCVX00                                    */
/*        FUNCTION          •••• ÉäÉXÉiÅ[                                    */
/*        AUTHER            •••• HAS M.Matsumoto                             */
/*        WRITTEN-DATE      •••• 2025-03-25                                  */
/*                                                                           */
/*        UPDATE            ••••                                             */
/*                                                                           */
/*   î≈  èCê≥é“     èCê≥ì˙     èCê≥ì‡óe                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  Matsumoto  2025/03/25 (J0680)êVãKçÏê¨                               */
/*                                                                           */
/*****************************************************************************/
#ifndef VPROC_H
#define VPROC_H

#define VPROC T0000A00_12NOV25_GFPCVX00_1000

void VPROC(void)  {return;}

#endif
