/*****************************************************************************/
/*****                    <<     SOURCE PROGRAM      >>                  *****/
/*****************************************************************************/
/*                                                                           */
/*        SYSTEM            •••• CBS                                         */
/*        SUB-SYSTEM        •••• GFPí êMêßå‰                                 */
/*        PROGRAM-ID        •••• GFPCSJ60                                    */
/*        FUNCTION          •••• ìdï∂ÉwÉbÉ_ìdï∂í∑ï“èW[CARDNET]               */
/*        AUTHER            •••• HAS M.Matsumoto                             */
/*        WRITTEN-DATE      •••• 2025-04-01                                  */
/*                                                                           */
/*        UPDATE            ••••                                             */
/*                                                                           */
/*   î≈  èCê≥é“     èCê≥ì˙     èCê≥ì‡óe                                      */
/*  ==== ========== ========== ============================================= */
/*  1.0  Matsumoto  2025/04/01 (J0680)êVãKçÏê¨                               */
/*                                                                           */
/*****************************************************************************/
#ifndef VPROC_H
#define VPROC_H

#define VPROC T0000A00_12JUL25_GFPCSJ60_1000

void VPROC(void)  {return;}

#endif
